tap "aws/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "versent/taps"
brew "asciidoctor"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Reimplementation of ctags(1)
brew "ctags"
# Pack, ship and run any application as a lightweight container
brew "docker"
brew "fzf"
# Distributed revision control system
brew "git"
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Powerful, lightweight programming language
brew "lua"
# Manage multiple Node.js versions
brew "nvm"
brew "ripgrep"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
brew "write-good"
# Linter for YAML files
brew "yamllint"
# Download YouTube videos from the command-line
brew "youtube-dl"
brew "versent/taps/saml2aws"
cask "1password"
cask "adobe-acrobat-reader"
# cask "amazon-chime"
cask "brave-browser"
cask "docker"
cask "drawio"
cask "dropbox"
cask "flux"
cask "font-source-sans-pro"
cask "iterm2"
cask "kindle"
# cask "microsoft-office"
# cask "microsoft-teams"
# cask "nosql-workbench-for-amazon-dynamodb"
cask "slack"
cask "spectacle"
cask "spotify"
cask "viscosity"
cask "vlc"
# cask "zoom"
