tap "aws/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "versent/taps"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Python code formatter
brew "black"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Reimplementation of ctags(1)
brew "ctags"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Run arbitrary commands when files change
brew "entr"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Powerful, lightweight programming language
brew "lua"
# Manage multiple Node.js versions
brew "nvm"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML documents from the CLI
brew "yq"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# GitHub CLI
brew "github/gh/gh"
brew "versent/taps/saml2aws"
cask "adobe-acrobat-reader"
cask "amazon-chime"
cask "docker"
cask "drawio"
cask "google-chrome"
cask "iterm2"
cask "kindle"
cask "microsoft-office"
cask "microsoft-teams"
cask "nosql-workbench-for-amazon-dynamodb"
cask "slack"
cask "spectacle"
cask "spotify"
cask "viscosity"
cask "vlc"
cask "zoomus"
